package other;

public class hw6 {
    public static void main(String[] args) {
//        Напишите программу вывода всех четных чисел от 2 до 100 включительно
        for (int i = 0; i <= 100; i += 2) {
            System.out.println("Четное число " + i);
        }
    }
}
